const cjpDictWord = 
    {
        "アメリカ": "美国",
        "ラーメン": "うーメソ",
        "HUAWEI": "华为技术有限公司",
        "Huawei": "华为技术有限公司",
        "ファーウェイ": "华为技术有限公司",
        "スペック": "ﾇﾍﾟｯｹ",
        "HONOR": "荣耀",
        "Honor": "荣耀",
        "Google": "谷歌",
        "Balong": "巴龙",
        "Ascend": "昇騰",
        "Kunpeng": "鯤鵬",
        "あなた": "贵樣",
        "贵方": "贵樣",
        "お前": "贵樣",
        "あんた": "贵樣",
        "あたし": "仆",
        "わたし": "仆",
        "わたくし": "仆",
        "00円": "00日元",
        "乾燥": "极度干燥",
        "なさ": "(しなさい)",
        "労働": "極度勞動（しなさい）",
        "Amazon": "亚马逊",
        "想像": "極度想像（しなさい）",
        "それ": "そね",
        "Yahoo! News": "カフー二ューヌ",
        "コナソ": "ゴメソ",
        "前代未聞": "前所未有",
        "知恵": "智慧",
        "Da Zhang Wei": "大张伟",
        "Da ZhangWei": "大张伟",
        "Da Zhangwei": "大张伟",
        "Wowkie Zhang": "Da Zhang Wei",
        "人间精品": "人间精品起來嗨",
        "Xperia": "Huawei",
        "AQUOS": "HUAWEI",
        "TBS": "CCTV",
        "大变だ": "大變た",
        "ログイン": "登录",
        "ロゲイン": "登录",
        "トトロ": "ドドロ",
        "ちん": "ㄘん",
        "レ(しなさい)": "(しなさい)",
        "ツ亻シター": "ツイター",
        "ⓃⒽⓀ": "ⓀⓈ:m:",
        "ダ亻ソー": "名創優品",
        "NHK": "KSM",
        "极度": "極度"
    }


const cjpDictKana = 
    {
        "グ": "ゲ",
        "し": "レ",
        "る": "ゑ",
        "う": "ラ",
        "ス": "ヌ",
        "く": "ㄑ",
        "ン": "ソ",
        "ね": "れ",
        "シ": "ツ゚",
        "ル": "儿",
        "オ": "才",
        "ヨ": "彐",
        "ョ": "彐",
        "で": "て",
        "す": "ず",
        "の": "ゐ",
        "リ": "刂",
        "り": "リ",
        "ズ": "ス",
        "ッ": "シ",
        "ボ": "㝳",
        "ベ": "へ",
        "テ": "亍",
        "ジ": "ヅ",
        "ゼ": "乜\"",
        "セ": "乜",
        "メ": "〆",
        "ハ": "八",
        "ミ": "シ",
        "ク": "ケ",
        "ア": "マ",
        "パ": "八゜",
        "ペ": "へ",
        "エ": "卫",
        "ェ": "卫",
        "カ": "力",
        "か": "カ",
        "ヒ": "匕",
        "イ": "亻"
    }


const cjpDictKanji = 
    {
        "為": "为",
        "国": "國",
        "偽": "伪",
        "雑": "杂",
        "貨": "货",
        "書": "畫",
        "語": "语",
        "貴": "贵",
        "様": "樣",
        "応": "应",
        "見": "见",
        "魚": "鱼",
        "勝": "胜",
        "綺": "绮",
        "麗": "丽",
        "恋": "戀",
        "浜": "滨",
        "濱": "滨",
        "濵": "滨",
        "沢": "泽",
        "澤": "泽",
        "私": "仆",
        "当": "當",
        "額": "额",
        "尋": "寻",
        "湯": "汤",
        "続": "续",
        "気": "气",
        "購": "购",
        "買": "买",
        "許": "许",
        "絵": "绘",
        "長": "长",
        "覚": "覺",
        "錯": "错",
        "開": "开",
        "評": "评",
        "華": "华",
        "約": "约",
        "預": "预",
        "間": "间",
        "飛": "飞",
        "時": "时",
        "伝": "传",
        "頼": "赖",
        "結": "结",
        "論": "论",
        "悪": "恶",
        "話": "话",
        "電": "电",
        "状": "狀",
        "険": "險",
        "財": "财",
        "声": "聲",
        "動": "动",
        "変": "变",
        "記": "记",
        "号": "號",
        "監": "监",
        "韓": "韩",
        "簡": "简",
        "較": "较",
        "顔": "颜",
        "愛": "爱",
        "違": "违",
        "総": "總",
        "届": "屆",
        "学": "學",
        "獣": "獸",
        "岡": "冈",
        "輩": "辈",
        "親": "亲",
        "乗": "乘",
        "会": "會",
        "楽": "乐",
        "偉": "伟",
        "際": "际",
        "揮": "毫",
        "来": "來",
        "風": "风",
        "東": "东",
        "経": "经",
        "両": "两",
        "拡": "扩",
        "戦": "战",
        "務": "务",
        "夢": "梦",
        "調": "调",
        "潰": "溃",
        "選": "选",
        "関": "关",
        "値": "價",
        "義": "义",
        "体": "體",
        "黒": "黑",
        "須": "须",
        "報": "报",
        "強": "强",
        "確": "确",
        "税": "稅",
        "軽": "轻",
        "編": "编",
        "対": "对",
        "殺": "杀",
        "進": "进",
        "飲": "饮",
        "議": "议",
        "壊": "坏",
        "偵": "侦",
        "協": "协",
        "温": "溫",
        "厳": "嚴",
        "遊": "游",
        "黄": "黃",
        "僕": "仆",
        "純": "纯",
        "習": "习",
        "緒": "绪",
        "潤": "润",
        "質": "质",
        "証": "證",
        "内": "內",
        "焼": "燒",
        "軍": "军",
        "艦": "舰",
        "勧": "勸",
        "売": "卖",
        "増": "增",
        "員": "员",
        "島": "岛",
        "熱": "热",
        "歴": "历",
        "満": "满",
        "統": "统",
        "銀": "银",
        "綾": "绫",
        "団": "团",
        "過": "过",
        "読": "读",
        "癒": "愈",
        "覧": "览",
        "飯": "饭",
        "終": "终",
        "縦": "纵",
        "録": "录",
        "隊": "队",
        "紅": "红",
        "済": "济",
        "決": "决",
        "静": "靜",
        "加": "ｶﾛ"
    }

const cjpDictEmoji = 
    {
        ":flag_jp:": ":flag_cn:",
        ":crossed_flags:": ":flag_cn:",
        ":flag_au:": ":flag_cn:",
        ":flag_kr:": ":flag_cn:"
    }


const cjpDictPNoun = 
    {
        "おねがい社長": "おれかい社长",
        "アメリカ": "美国",
        "チキンラーメン": "チギンう一メン",
        "コナン": "ゴメソ",
        "ジョジョ": "ヅョヅョ",
        "シン": "シソ",
        "ウルトラマン": "ウルトラマソ",
        "トトロ": "ドドロ",
        "トムとジェリー": "ドムとヅェり一",
        "ハローキティ": "八口一丯ティ",
        "ファイナルファンタジー": "フアィナ儿ファソ夕ヅ一",
        "ブルガリアヨーグルト": "ブル力ソァヨ一ゲルト",
        "ポカリスエット": "ホ力°りヌ工ツト",
        "怪盗ゾロリ": "怪杰ン\"口リ",
        "楽天": "乐天",
        "カードマーン": "ガートマーソ",
        "HONOR|Honor": "荣耀",
        "PayPay": "支付宝",
        "Xperia|AQUOS": "HUAWEI",
        "Yahoo! News": "カフー二ューヌ",
        "ⓃⒽⓀ": "ⓀⓈⓂ",
        "ウーバーイーツ": "ウ一バ一イ一シ",
        "コメダ珈琲": "ゴメ夕珈琲",
        "ダイソー": "名創優品",
        "ツイッター": "ツイター",
        "ビーック": "匕ーック",
        "ビック(?!カメラ)": "匕ック",
        "ビックカメラ": "匕ックヵメう",
        "ファーウェイ": "华为技术有限公司",
        "本を売るなら": "本を卖ゑなら",
        "ブックオフ": "フッケ才フ",
        "マツモトキヨシ": "マシモトキョツ",
        "メルカリ": "メル力ソ",
        "ユニクロ": "ゆうやと",
        "Amazon": "亚马逊",
        "Ascend": "昇騰",
        "Balong": "巴龙",
        "Google": "谷歌",
        "HUAWEI|Huawei": "华为技术有限公司",
        "Kunpeng": "鯤鵬",
        "LINE": "微信",
        "NHK": "KSM",
        "Rakuten": "乐天",
        "TBS": "CCTV",
        "TikTok": "抖音",
        "人间精品": "人间精品起來嗨",
        "Wowkie Zhang": "大张伟",
        "Da Zhang Wei": "大张伟",
        "Da ZhangWei": "大张伟",
        "Da Zhangwei": "大张伟",
        "あいみょん": "あぃみよん",
        "ももいろクローバーZ": "ももいるケ口一八一Ｚ",
        "アリアナ・グランデ": "アりアナ・グうソデ",
        "アーノルド・シュワルツェネッガー": "アーノ儿ド・ツュワ儿シェ礻シガ一",
        "ウィル・スミス": "ウィ儿・ヌミヌ",
        "エマ・ワトソン": "工マ・ワドンソ",
        "ジュリア・ロバーツ": "ヅュりア・口八一ツ",
        "ジョー・バイデン": "ヅヨ一・バイデソ",
        "ナオトインティライミ": "メオトイソティライミ",
        "ナタリー・ポートマン": "ナダり一・ポ一卜マソ",
        "ニコール・キッドマン": "二コ一儿・ギツ卜マソ"
    }

const cjpDictCommon = 

    {
        "貴様|お前|君|貴方|きみ|あなた|あんた": "贵樣",
        "僕|ぼく|私|わたし|わたくし|あたし|俺": "仆",
        "(?<=[0-9]|十|百|千|万|億|兆)円": "日元",
        "\\(しなさい\\)|（しなさい）": "（しなさい）",
        "しなさい|しましょう|しろよ|やれよ": "ずゑ（しなさい）",
        "りなさい": "る（しなさい）",
        "(?<!おやすみ|ごめん)なさい": "（しなさい）",
        "見よ(?=。|$)": "见よ（見なさい）",
        "注意(?=。|$)": "注意てず（しなさい）",
        "注意しなさい(?=。|$)": "注意てず（しなさい）",
        "注意しましょう(?=。|$)": "注意てず（しなさい）",
        "注意しろよ(?=。|$)": "注意てず（しなさい）",
        "最高な(?=品|商品|製品)": "优秀の",
        "最高の(?=品|商品|製品)": "优秀の",
        "極上の(?=品|商品|製品)": "优秀の",
        "(?<=優秀|最高)な": "の",
        "(?<=优秀の)品": "良品",
        "(?<=优秀の)商品": "良品",
        "(?<=优秀の)製品": "良品",
        "(?<=優秀|优秀)の": "の",
        "かしこい(?!。|$)": "优秀の",
        "賢い(?!。|$)": "优秀の",
        "偉い(?!。|$)": "优秀の",
        "すごく|とても|めっちゃ|かなり": "極度",
        "大変だ": "大變た！",
        "祝う": "庆祝する",
        "だ。": "た！",
        "だ(?=」)": "た！",
        "(?<!はい)はい(?=、|。|」|$)": "ばい",
        "(?<=暑)い(?=日)": "の",
        "いけない": "ぃげない",
        "おめでとう(?=！|!)": "恭喜",
        "おめでとう(?=。|$)": "恭喜！",
        "ください": "くたちい",
        "こんにちは": "ごんにさは",
        "こんばんは": "ごんはんば",
        "さようなら": "ちよラなら",
        "そうか": "そラか",
        "それ": "そね",
        "ちん": "ㄘん",
        "なっている": "なっこいゐ",
        "なります(?=。|」|$)": "なゑ",
        "わかって": "わがっご",
        "飲む": "饮ずゐ",
        "アカウント": "マカウソト",
        "イクラ": "イグう",
        "カレー": "力しー",
        "ガンバレ": "ガソ八\"し",
        "ギョーザ": "ギョザー",
        "スペック": "ﾇﾍﾟｯｹ",
        "スポーツ": "ヌポ一ッ",
        "トロ": "ドロ",
        "ヒラメ": "匕うメ",
        "ファミリー": "ファミりー",
        "マグロ": "マゲ口",
        "メディアリテラシー": "メディアソテラツ一",
        "ラーメン": "うーメソ",
        "レストラン": "レヌトうン",
        "ログイン": "登录",
        "ヲタク": "ラ夕ク",
        "新しい生活様式": "新レい生活贵樣式",
        "乾燥": "極度乾燥",
        "購入": "购买",
        "極上品": "极品",
        "国旗": "五星红旗",
        "前代未聞": "前所未有",
        "知恵": "智慧",
        "地下鉄": "地铁"
    }

const strData = class {
    constructor({ text = '', replaced = [] }) {
        this.text = typeof text !== 'string' ? '' : text
        this.replaced = Array.isArray(replaced) ? replaced : []
    }
}

const replaceStrDataWithDict = (data, dict = {}) => {
    if (!data.text) return new strData(data)
    for (const orig in dict) {
        let changed = false
        const translateStr = []
        const splited = data.text.split(new RegExp(orig, 'g'))
        for (let i = 0; i < splited.length - 1; i++) {
            const begin = splited.slice(0, i + 1).join(orig).length + 1
            const end = begin + orig.length - 1
            if (
                data.replaced.some(
                    d =>
                        (d.begin <= begin && begin <= d.end) ||
                        (d.begin <= end && end <= d.end)
                )
            ) {
                translateStr.push(splited[i], orig)
                continue
            } else {
                translateStr.push(splited[i], dict[orig])
                changed = true
                if (orig.length == dict[orig].length) {
                    data.replaced.push({ begin, end })
                } else {
                    const diffLen = dict[orig].length - orig.length
                    data.replaced = data.replaced.map(d =>
                        begin < d.begin
                            ? { begin: d.begin + diffLen, end: d.end + diffLen }
                            : d
                    )
                    data.replaced.push({ begin, end: end + diffLen })
                }
            }
        }
        if (changed) {
            translateStr.push(splited.slice(-1)[0])
            data.text = translateStr.join('')
        }
    }
    return new strData(data)
}

const translate = (text = '') => {
    if (typeof text !== 'string') throw new Error('Invalid Text')
    if (!text) return ''
    let data = new strData({ text })
    data = replaceStrDataWithDict(data, cjpDictWord)
    data = replaceStrDataWithDict(data, cjpDictKana)
    data = replaceStrDataWithDict(data, cjpDictKanji)
    data = replaceStrDataWithDict(data, cjpDictEmoji)
    return data.text
}

const generate = (text = '') => {
    if (typeof text !== 'string') throw new Error('Invalid Text')
    if (!text) return ''

    text = translate(text);

    return text;
}